app/Controllers/Product.php

    public function index()
    {
        $data = ["products" => $this->productModel->findAll()];
---
SELECT *
FROM `products`