app/Controllers/User.php

    public function index()
    {
        $data = ["users" => $this->userModel->findAll()];
---
SELECT *
FROM `users`